<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="keras_tensor" type="Parameter" version="opset1">
			<data shape="?,3000,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="keras_tensor">
					<dim>-1</dim>
					<dim>3000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_325" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="sequential_1/bidirectional_1/forward_lstm_1/while/LogicalAnd" type="Const" version="opset1">
			<data element_type="boolean" shape="" offset="4" size="1" />
			<output>
				<port id="0" precision="BOOL" />
			</output>
		</layer>
		<layer id="3" name="sequential_1/bidirectional_1/forward_lstm_1/while/loop_counter" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="4" name="sequential_1/bidirectional_1/forward_lstm_1/time" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="9" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="sequential_1/bidirectional_1/forward_lstm_1/zeros/Const_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="9" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="8" name="sequential_1/bidirectional_1/forward_lstm_1/zeros/Const" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="Constant_2161" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Transpose_2162" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_2163" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="35" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Transpose_104" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Transpose_106_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1, 1, 3" offset="39" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Transpose_106" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Convolution_107" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_1717" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="35" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Transpose_1719" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2998</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Transpose_1723_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1" offset="423" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Transpose_1723" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Transpose_1725" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Transpose_1727" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_1731_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1" offset="551" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Transpose_1731" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Transpose_1733" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Transpose_1737_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1" offset="679" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Transpose_1737" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Transpose_1739" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="sequential_1/max_pooling1d_1/MaxPool1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="807" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="29" name="Transpose_1742" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_4091" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="811" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Transpose_118" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>2998</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2998</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="MaxPool_119" type="MaxPool" version="opset8">
			<data strides="1, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="1, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2998</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1499</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1499</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_1746" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="35" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Transpose_1748" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1499</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1499</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="sequential_1/conv1d_1_2/convolution/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="843" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="36" name="Transpose_1751" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1499</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>1499</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_4093" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="811" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Transpose_126" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>1499</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1499</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Transpose_128_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 1, 3" offset="847" size="49152" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Transpose_128" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Convolution_129" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1499</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_1755" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="35" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Transpose_1757" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1497</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Transpose_1761_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="49999" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Transpose_1761" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_1763" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Transpose_1765" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Transpose_1769_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="50255" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Transpose_1769" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Transpose_1771" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Transpose_1775_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="50511" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Transpose_1775" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Transpose_1777" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="sequential_1/max_pooling1d_1_2/MaxPool1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="807" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="55" name="Transpose_1780" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_4101" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="50767" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_140" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>1497</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1497</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="MaxPool_141" type="MaxPool" version="opset8">
			<data strides="1, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="1, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1497</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>748</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>748</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_1784" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="35" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Transpose_1786" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>748</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>748</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_352" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="5" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Transpose_1795" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>748</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
					<dim>748</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="ShapeOf_4409" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
					<dim>748</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_4536" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="50799" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_4411" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="50807" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="66" name="Gather_4412" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Unsqueeze_167" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="50815" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="sequential_1/bidirectional_1/forward_lstm_1/zeros/packed" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="sequential_1/bidirectional_1/forward_lstm_1/zeros" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_1791" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="50819" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="sequential_1/bidirectional_1/backward_lstm_1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>748</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>748</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="sequential_1/bidirectional_1/forward_lstm_1/while" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="2" internal_layer_id="5" />
				<input external_port_id="3" internal_layer_id="4" />
				<input external_port_id="4" internal_layer_id="3" />
				<input external_port_id="5" internal_layer_id="2" />
				<input external_port_id="6" internal_layer_id="1" />
				<input external_port_id="7" internal_layer_id="0" />
				<output external_port_id="8" internal_layer_id="53" />
				<output external_port_id="-1" internal_layer_id="15" purpose="execution_condition" />
			</port_map>
			<back_edges>
				<edge from-layer="55" to-layer="5" />
				<edge from-layer="54" to-layer="4" />
				<edge from-layer="53" to-layer="3" />
				<edge from-layer="40" to-layer="2" />
				<edge from-layer="36" to-layer="1" />
			</back_edges>
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="BOOL" />
				<port id="2" precision="I32" />
				<port id="3" precision="I32" />
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>748</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="5" name="sequential_1_bidirectional_1_forward_lstm_1_while_sequential_1_bidirectional_1_forward_lstm_1_while_loop_counter" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="4" name="sequential_1_bidirectional_1_forward_lstm_1_while_placeholder" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="3" name="sequential_1_bidirectional_1_forward_lstm_1_while_placeholder_1" type="Parameter" version="opset1">
						<data shape="1,?,?" element_type="f32" />
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="sequential_1_bidirectional_1_forward_lstm_1_while_placeholder_2" type="Parameter" version="opset1">
						<data shape="?,64" element_type="f32" />
						<output>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="sequential_1_bidirectional_1_forward_lstm_1_while_placeholder_3" type="Parameter" version="opset1">
						<data shape="?,64" element_type="f32" />
						<output>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="0" name="sequential_1_bidirectional_1_forward_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_1_bidirectional_1_forward_lstm_1_tensorarrayunstack_tensorlistfromtensor_0" type="Parameter" version="opset1">
						<data shape="748,?,128" element_type="f32" />
						<output>
							<port id="0" precision="FP32">
								<dim>748</dim>
								<dim>-1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="sequential_1/bidirectional_1/forward_lstm_1/while/add_1/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="807" size="4" />
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="7" name="sequential_1/bidirectional_1/forward_lstm_1/while/add_1" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" />
						</output>
					</layer>
					<layer id="8" name="sequential_1/bidirectional_1/forward_lstm_1/Max" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="50843" size="4" />
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="9" name="sequential_1/bidirectional_1/forward_lstm_1/while/Less_1" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="10" name="sequential_1/bidirectional_1/forward_lstm_1/while/add/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="807" size="4" />
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="11" name="sequential_1/bidirectional_1/forward_lstm_1/while/add" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" />
						</output>
					</layer>
					<layer id="12" name="sequential_1/bidirectional_1/forward_lstm_1/while/Less/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="50843" size="4" />
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="13" name="sequential_1/bidirectional_1/forward_lstm_1/while/Less" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="14" name="sequential_1/bidirectional_1/forward_lstm_1/while/LogicalAnd_1" type="LogicalAnd" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="BOOL" />
							<port id="1" precision="BOOL" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="16" name="Constant_1637" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="5" size="4" />
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="Gather_1638" type="Gather" version="opset8">
						<data batch_dims="0" />
						<input>
							<port id="0" precision="FP32">
								<dim>748</dim>
								<dim>-1</dim>
								<dim>128</dim>
							</port>
							<port id="1" precision="I32" />
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="3" precision="FP32">
								<dim>-1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="Transpose_4108_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="256, 128" offset="50847" size="65536" />
						<output>
							<port id="0" precision="FP16">
								<dim>256</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="19" name="Transpose_4108" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>256</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>256</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/MatMul" type="MatMul" version="opset1">
						<data transpose_a="false" transpose_b="true" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>128</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>256</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="Transpose_4111_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="256, 64" offset="116383" size="32768" />
						<output>
							<port id="0" precision="FP16">
								<dim>256</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="22" name="Transpose_4111" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>256</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>256</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="23" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/MatMul_1" type="MatMul" version="opset1">
						<data transpose_a="false" transpose_b="true" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>256</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/Add" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="Constant_4313_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="1, 256" offset="149151" size="512" />
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="Constant_4313" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="27" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/BiasAdd" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="28" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/split/split_dim" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="807" size="4" />
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="29" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/split" type="Split" version="opset1">
						<data num_splits="4" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>256</dim>
							</port>
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="3" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="4" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="5" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="30" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/Sigmoid_1" type="Sigmoid" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="31" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/mul" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="32" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/Sigmoid" type="Sigmoid" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="33" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/Tanh" type="Tanh" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="34" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/mul_1" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="35" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/add_1" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="37" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/Sigmoid_2" type="Sigmoid" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="38" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/Tanh_1" type="Tanh" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="39" name="sequential_1/bidirectional_1/forward_lstm_1/while/lstm_cell_1/mul_2" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="41" name="ShapeOf_1601" type="ShapeOf" version="opset3">
						<data output_type="i32" />
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="I32">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="42" name="Constant_1602" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="5" size="4" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="43" name="Constant_1603" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="807" size="4" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="44" name="Constant_1605" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="50807" size="8" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="45" name="Slice_1604" type="Slice" version="opset8">
						<input>
							<port id="0" precision="I32">
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
							<port id="4" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="5" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="46" name="ShapeOf_1606" type="ShapeOf" version="opset3">
						<data output_type="i32" />
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="47" name="Concat_1607" type="Concat" version="opset1">
						<data axis="0" />
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="48" name="Constant_1608" type="Const" version="opset1">
						<data element_type="u8" shape="" offset="149663" size="1" />
						<output>
							<port id="0" precision="U8" />
						</output>
					</layer>
					<layer id="49" name="Broadcast_1609" type="Broadcast" version="opset1">
						<data mode="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>3</dim>
							</port>
							<port id="2" precision="U8" />
						</input>
						<output>
							<port id="3" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="50" name="Reshape_1600" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="5" size="4" />
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="51" name="Unsqueeze_1616" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="52" name="sequential_1/bidirectional_1/forward_lstm_1/while/TensorArrayV2Write/TensorListSetItem" type="ScatterUpdate" version="opset3">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>64</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="55" name="sequential_1_bidirectional_1_forward_lstm_1_while_identity_1" type="Result" version="opset1">
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="54" name="sequential_1_bidirectional_1_forward_lstm_1_while_identity_2" type="Result" version="opset1">
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="53" name="sequential_1_bidirectional_1_forward_lstm_1_while_identity_3" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
					</layer>
					<layer id="40" name="sequential_1_bidirectional_1_forward_lstm_1_while_identity_4" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
					</layer>
					<layer id="36" name="sequential_1_bidirectional_1_forward_lstm_1_while_identity_5" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>64</dim>
							</port>
						</input>
					</layer>
					<layer id="15" name="sequential_1_bidirectional_1_forward_lstm_1_while_identity" type="Result" version="opset1">
						<input>
							<port id="0" precision="BOOL" />
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="17" to-port="0" />
					<edge from-layer="1" from-port="0" to-layer="31" to-port="1" />
					<edge from-layer="2" from-port="0" to-layer="23" to-port="0" />
